Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, 4, 256, 256) 0
__________________________________________________________________________________________________
sequential (Sequential)         (None, 64, 128, 128) 4096        input_1[0][0]
__________________________________________________________________________________________________
sequential_1 (Sequential)       (None, 128, 64, 64)  131328      sequential[0][0]
__________________________________________________________________________________________________
sequential_2 (Sequential)       (None, 256, 32, 32)  524800      sequential_1[0][0]
__________________________________________________________________________________________________
sequential_3 (Sequential)       (None, 512, 16, 16)  2098176     sequential_2[0][0]
__________________________________________________________________________________________________
sequential_4 (Sequential)       (None, 512, 8, 8)    4195328     sequential_3[0][0]
__________________________________________________________________________________________________
sequential_5 (Sequential)       (None, 512, 4, 4)    4195328     sequential_4[0][0]
__________________________________________________________________________________________________
sequential_6 (Sequential)       (None, 512, 2, 2)    4195328     sequential_5[0][0]
__________________________________________________________________________________________________
sequential_7 (Sequential)       (None, 512, 1, 1)    4194304     sequential_6[0][0]
__________________________________________________________________________________________________
sequential_8 (Sequential)       (None, 512, 2, 2)    4195328     sequential_7[0][0]
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 1024, 2, 2)   0           sequential_8[0][0]
                                                                 sequential_6[0][0]
__________________________________________________________________________________________________
sequential_9 (Sequential)       (None, 512, 4, 4)    8389632     concatenate[0][0]
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 1024, 4, 4)   0           sequential_9[0][0]
                                                                 sequential_5[0][0]
__________________________________________________________________________________________________
sequential_10 (Sequential)      (None, 512, 8, 8)    8389632     concatenate_1[0][0]
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 1024, 8, 8)   0           sequential_10[0][0]
                                                                 sequential_4[0][0]
__________________________________________________________________________________________________
sequential_11 (Sequential)      (None, 512, 16, 16)  8389632     concatenate_2[0][0]
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 1024, 16, 16) 0           sequential_11[0][0]
                                                                 sequential_3[0][0]
__________________________________________________________________________________________________
sequential_12 (Sequential)      (None, 256, 32, 32)  4194816     concatenate_3[0][0]
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 512, 32, 32)  0           sequential_12[0][0]
                                                                 sequential_2[0][0]
__________________________________________________________________________________________________
sequential_13 (Sequential)      (None, 128, 64, 64)  1048832     concatenate_4[0][0]
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 256, 64, 64)  0           sequential_13[0][0]
                                                                 sequential_1[0][0]
__________________________________________________________________________________________________
sequential_14 (Sequential)      (None, 64, 128, 128) 262272      concatenate_5[0][0]
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 128, 128, 128 0           sequential_14[0][0]
                                                                 sequential[0][0]
__________________________________________________________________________________________________
sequential_15 (Sequential)      (None, 4, 256, 256)  8196        concatenate_6[0][0]
==================================================================================================
Total params: 54,417,028
Trainable params: 54,417,028
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
img_A (InputLayer)              [(None, 4, 256, 256) 0
__________________________________________________________________________________________________
img_B (InputLayer)              [(None, 4, 256, 256) 0
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 8, 256, 256)  0           img_A[0][0]
                                                                 img_B[0][0]
__________________________________________________________________________________________________
sequential_16 (Sequential)      (None, 64, 128, 128) 8256        concatenate_7[0][0]
__________________________________________________________________________________________________
sequential_17 (Sequential)      (None, 128, 64, 64)  131456      sequential_16[0][0]
__________________________________________________________________________________________________
sequential_18 (Sequential)      (None, 256, 32, 32)  525056      sequential_17[0][0]
__________________________________________________________________________________________________
sequential_19 (Sequential)      (None, 512, 16, 16)  2098688     sequential_18[0][0]
__________________________________________________________________________________________________
zero_padding2d_13 (ZeroPadding2 (None, 512, 19, 19)  0           sequential_19[0][0]
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 4, 16, 16)    32768       zero_padding2d_13[0][0]
==================================================================================================
Total params: 2,796,224
Trainable params: 2,796,224
Non-trainable params: 0
__________________________________________________________________________________________________
